In [6]:
import pandas as pd

sadsadasdddddddddddddd hj é sexta sadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sextasadsadasdddddddddddddd hj é sexta

# Data Science Team

In [4]:
dataset = pd.DataFrame({'A':[1,2,3,4,5,6], 'B': [7,8,9,10,11,12], 'C': ['a','b','c','d','e','f']})

In [5]:
dataset

   A   B  C
0  1   7  a
1  2   8  b
2  3   9  c
3  4  10  d
4  5  11  e
5  6  12  f

In [6]:
dataset[['A','B']].drop_duplicates()

   A   B
0  1   7
1  2   8
2  3   9
3  4  10
4  5  11
5  6  12

In [7]:
dataset[['A','B']].drop_duplicates()

   A   B
0  1   7
1  2   8
2  3   9
3  4  10
4  5  11
5  6  12

In [8]:
dataset[dataset['A'] > 3]

   A   B  C
3  4  10  d
4  5  11  e
5  6  12  f

In [10]:
dataset[dataset['A'] + dataset['B'] >= 10]

   A   B  C
1  2   8  b
2  3   9  c
3  4  10  d
4  5  11  e
5  6  12  f

In [18]:
dataset2 = dataset.set_index(['C','A'])

In [19]:
dataset2

      B
C A
a 1   7
b 2   8
c 3   9
d 4  10
e 5  11
f 6  12

In [20]:
dataset2.value_counts()

B
7     1
8     1
9     1
10    1
11    1
12    1
dtype: int64

In [1]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})


def square(x):
    return x * x


df1 = df.apply(square)

print(df)
print(df1)

   A   B
0  1  10
1  2  20
   A    B
0  1  100
1  4  400

In [9]:
df = pd.DataFrame({'A': ['a','b','a'],'B': ['a','b','a'],'C': ['a','b','c'],})

In [10]:
df

   A  B  C
0  a  a  a
1  b  b  b
2  a  a  c

In [11]:
df.groupby(['A','B']).value_counts()

A  B  C
a  a  a    1
      c    1
b  b  b    1
dtype: int64